# Estadística Aplicada
## Cinthya Yesenia López Díaz 1658003
### 3ra Sesión

In [1]:
import numpy as np
import pandas as pd

In [2]:
alumno1 = ['Juan', 'Perez', 23]
alumno2 = ['Raul', 'Lopez', 15]
alumno3 = ['Jhon', 'Lara', 18]
alumno4 = ['Xime', 'Lira', 22]
alumno5 = ['Ale', 'Lugo', 26]

In [3]:
estadistica = [alumno1, alumno2, alumno3, alumno4, alumno5]

In [5]:
estadistica = pd.DataFrame(estadistica, columns=['Nombre', 'Apellido', 'Edad'])
estadistica

  Nombre Apellido  Edad
0   Juan    Perez    23
1   Raul    Lopez    15
2   Jhon     Lara    18
3   Xime     Lira    22
4    Ale     Lugo    26

In [6]:
estadistica.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [7]:
estadistica.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
estadistica.shape

(5, 3)

In [9]:
estadistica.describe()

           Edad
count   5.00000
mean   20.80000
std     4.32435
min    15.00000
25%    18.00000
50%    22.00000
75%    23.00000
max    26.00000

In [10]:
estadistica['Edad en días'] = estadistica['Edad'] * 365

In [11]:
estadistica

  Nombre Apellido  Edad  Edad en días
0   Juan    Perez    23          8395
1   Raul    Lopez    15          5475
2   Jhon     Lara    18          6570
3   Xime     Lira    22          8030
4    Ale     Lugo    26          9490

In [12]:
estadistica['Origen'] = ['Apodaca', 'San Pedro', 'Guadalupe', 'Salinas', 'Cadereyta']

In [13]:
estadistica

  Nombre Apellido  Edad  Edad en días     Origen
0   Juan    Perez    23          8395    Apodaca
1   Raul    Lopez    15          5475  San Pedro
2   Jhon     Lara    18          6570  Guadalupe
3   Xime     Lira    22          8030    Salinas
4    Ale     Lugo    26          9490  Cadereyta

In [14]:
estadistica['Edad'].mean()

20.8

In [15]:
round(estadistica['Edad'].std(ddof=1), 2)

4.32

In [17]:
estadistica.dtypes

Nombre          object
Apellido        object
Edad             int64
Edad en días     int64
Origen          object
dtype: object

In [18]:
estadistica.count()

Nombre          5
Apellido        5
Edad            5
Edad en días    5
Origen          5
dtype: int64

In [19]:
estadistica.sort_values('Apellido', ascending=True)

  Nombre Apellido  Edad  Edad en días     Origen
2   Jhon     Lara    18          6570  Guadalupe
3   Xime     Lira    22          8030    Salinas
1   Raul    Lopez    15          5475  San Pedro
4    Ale     Lugo    26          9490  Cadereyta
0   Juan    Perez    23          8395    Apodaca

In [21]:
estadistica.sort_values(['Apellido', 'Nombre'], ascending=[True, True])

  Nombre Apellido  Edad  Edad en días     Origen
2   Jhon     Lara    18          6570  Guadalupe
3   Xime     Lira    22          8030    Salinas
1   Raul    Lopez    15          5475  San Pedro
4    Ale     Lugo    26          9490  Cadereyta
0   Juan    Perez    23          8395    Apodaca